module solution_helmholtz_class
  use misc
  use math
  use mesh3d_class
  implicit none
  private

  type,public :: solution_helmholtz
     !> 境界メッシュ
     type(mesh3d),pointer :: mesh => null()
     !> 境界上の解 (:,1): u, (:,2): q
     complex(8),allocatable :: u_bndry(:,:)

     !> 角周波数
     real(8) :: w
     !> 位相速度
     real(8) :: c
     !> 波数
     real(8) :: k

     !> 三角形上のGauss積分の積分点の数
     integer :: ng_tri
     !> 三角形上のGauss積分の積分点の面積座標 (3,ng_tri)
     real(8),allocatable :: gauss_tri_xi(:,:)
     !> 三角形上のGauss積分の積分点の重み (ng_tri)
     real(8),allocatable :: gauss_tri_w(:)
   contains
     !> finalizer
     procedure :: destructor
     !> 初期化
     procedure :: init
     !> 境界の解を出力
     procedure :: output_bndry
     !> 境界の解をファイルに出力 (geomviewで表示用)
     procedure :: output_bndry_geomview
     !> 境界の解を積分してoutgoing coefficientsを計算
     procedure :: calc_B
  end type solution_helmholtz

  integer,parameter :: cmap(3,256) = reshape(&
       int([ &
       0.00000d0, 0.00000d0, 0.51562d0, &
       0.00000d0, 0.00000d0, 0.53125d0, &
       0.00000d0, 0.00000d0, 0.54688d0, &
       0.00000d0, 0.00000d0, 0.56250d0, &
       0.00000d0, 0.00000d0, 0.57812d0, &
       0.00000d0, 0.00000d0, 0.59375d0, &
       0.00000d0, 0.00000d0, 0.60938d0, &
       0.00000d0, 0.00000d0, 0.62500d0, &
       0.00000d0, 0.00000d0, 0.64062d0, &
       0.00000d0, 0.00000d0, 0.65625d0, &
       0.00000d0, 0.00000d0, 0.67188d0, &
       0.00000d0, 0.00000d0, 0.68750d0, &
       0.00000d0, 0.00000d0, 0.70312d0, &
       0.00000d0, 0.00000d0, 0.71875d0, &
       0.00000d0, 0.00000d0, 0.73438d0, &
       0.00000d0, 0.00000d0, 0.75000d0, &
       0.00000d0, 0.00000d0, 0.76562d0, &
       0.00000d0, 0.00000d0, 0.78125d0, &
       0.00000d0, 0.00000d0, 0.79688d0, &
       0.00000d0, 0.00000d0, 0.81250d0, &
       0.00000d0, 0.00000d0, 0.82812d0, &
       0.00000d0, 0.00000d0, 0.84375d0, &
       0.00000d0, 0.00000d0, 0.85938d0, &
       0.00000d0, 0.00000d0, 0.87500d0, &
       0.00000d0, 0.00000d0, 0.89062d0, &
       0.00000d0, 0.00000d0, 0.90625d0, &
       0.00000d0, 0.00000d0, 0.92188d0, &
       0.00000d0, 0.00000d0, 0.93750d0, &
       0.00000d0, 0.00000d0, 0.95312d0, &
       0.00000d0, 0.00000d0, 0.96875d0, &
       0.00000d0, 0.00000d0, 0.98438d0, &
       0.00000d0, 0.00000d0, 1.00000d0, &
       0.00000d0, 0.01562d0, 1.00000d0, &
       0.00000d0, 0.03125d0, 1.00000d0, &
       0.00000d0, 0.04688d0, 1.00000d0, &
       0.00000d0, 0.06250d0, 1.00000d0, &
       0.00000d0, 0.07812d0, 1.00000d0, &
       0.00000d0, 0.09375d0, 1.00000d0, &
       0.00000d0, 0.10938d0, 1.00000d0, &
       0.00000d0, 0.12500d0, 1.00000d0, &
       0.00000d0, 0.14062d0, 1.00000d0, &
       0.00000d0, 0.15625d0, 1.00000d0, &
       0.00000d0, 0.17188d0, 1.00000d0, &
       0.00000d0, 0.18750d0, 1.00000d0, &
       0.00000d0, 0.20312d0, 1.00000d0, &
       0.00000d0, 0.21875d0, 1.00000d0, &
       0.00000d0, 0.23438d0, 1.00000d0, &
       0.00000d0, 0.25000d0, 1.00000d0, &
       0.00000d0, 0.26562d0, 1.00000d0, &
       0.00000d0, 0.28125d0, 1.00000d0, &
       0.00000d0, 0.29688d0, 1.00000d0, &
       0.00000d0, 0.31250d0, 1.00000d0, &
       0.00000d0, 0.32812d0, 1.00000d0, &
       0.00000d0, 0.34375d0, 1.00000d0, &
       0.00000d0, 0.35938d0, 1.00000d0, &
       0.00000d0, 0.37500d0, 1.00000d0, &
       0.00000d0, 0.39062d0, 1.00000d0, &
       0.00000d0, 0.40625d0, 1.00000d0, &
       0.00000d0, 0.42188d0, 1.00000d0, &
       0.00000d0, 0.43750d0, 1.00000d0, &
       0.00000d0, 0.45312d0, 1.00000d0, &
       0.00000d0, 0.46875d0, 1.00000d0, &
       0.00000d0, 0.48438d0, 1.00000d0, &
       0.00000d0, 0.50000d0, 1.00000d0, &
       0.00000d0, 0.51562d0, 1.00000d0, &
       0.00000d0, 0.53125d0, 1.00000d0, &
       0.00000d0, 0.54688d0, 1.00000d0, &
       0.00000d0, 0.56250d0, 1.00000d0, &
       0.00000d0, 0.57812d0, 1.00000d0, &
       0.00000d0, 0.59375d0, 1.00000d0, &
       0.00000d0, 0.60938d0, 1.00000d0, &
       0.00000d0, 0.62500d0, 1.00000d0, &
       0.00000d0, 0.64062d0, 1.00000d0, &
       0.00000d0, 0.65625d0, 1.00000d0, &
       0.00000d0, 0.67188d0, 1.00000d0, &
       0.00000d0, 0.68750d0, 1.00000d0, &
       0.00000d0, 0.70312d0, 1.00000d0, &
       0.00000d0, 0.71875d0, 1.00000d0, &
       0.00000d0, 0.73438d0, 1.00000d0, &
       0.00000d0, 0.75000d0, 1.00000d0, &
       0.00000d0, 0.76562d0, 1.00000d0, &
       0.00000d0, 0.78125d0, 1.00000d0, &
       0.00000d0, 0.79688d0, 1.00000d0, &
       0.00000d0, 0.81250d0, 1.00000d0, &
       0.00000d0, 0.82812d0, 1.00000d0, &
       0.00000d0, 0.84375d0, 1.00000d0, &
       0.00000d0, 0.85938d0, 1.00000d0, &
       0.00000d0, 0.87500d0, 1.00000d0, &
       0.00000d0, 0.89062d0, 1.00000d0, &
       0.00000d0, 0.90625d0, 1.00000d0, &
       0.00000d0, 0.92188d0, 1.00000d0, &
       0.00000d0, 0.93750d0, 1.00000d0, &
       0.00000d0, 0.95312d0, 1.00000d0, &
       0.00000d0, 0.96875d0, 1.00000d0, &
       0.00000d0, 0.98438d0, 1.00000d0, &
       0.00000d0, 1.00000d0, 1.00000d0, &
       0.01562d0, 1.00000d0, 0.98438d0, &
       0.03125d0, 1.00000d0, 0.96875d0, &
       0.04688d0, 1.00000d0, 0.95312d0, &
       0.06250d0, 1.00000d0, 0.93750d0, &
       0.07812d0, 1.00000d0, 0.92188d0, &
       0.09375d0, 1.00000d0, 0.90625d0, &
       0.10938d0, 1.00000d0, 0.89062d0, &
       0.12500d0, 1.00000d0, 0.87500d0, &
       0.14062d0, 1.00000d0, 0.85938d0, &
       0.15625d0, 1.00000d0, 0.84375d0, &
       0.17188d0, 1.00000d0, 0.82812d0, &
       0.18750d0, 1.00000d0, 0.81250d0, &
       0.20312d0, 1.00000d0, 0.79688d0, &
       0.21875d0, 1.00000d0, 0.78125d0, &
       0.23438d0, 1.00000d0, 0.76562d0, &
       0.25000d0, 1.00000d0, 0.75000d0, &
       0.26562d0, 1.00000d0, 0.73438d0, &
       0.28125d0, 1.00000d0, 0.71875d0, &
       0.29688d0, 1.00000d0, 0.70312d0, &
       0.31250d0, 1.00000d0, 0.68750d0, &
       0.32812d0, 1.00000d0, 0.67188d0, &
       0.34375d0, 1.00000d0, 0.65625d0, &
       0.35938d0, 1.00000d0, 0.64062d0, &
       0.37500d0, 1.00000d0, 0.62500d0, &
       0.39062d0, 1.00000d0, 0.60938d0, &
       0.40625d0, 1.00000d0, 0.59375d0, &
       0.42188d0, 1.00000d0, 0.57812d0, &
       0.43750d0, 1.00000d0, 0.56250d0, &
       0.45312d0, 1.00000d0, 0.54688d0, &
       0.46875d0, 1.00000d0, 0.53125d0, &
       0.48438d0, 1.00000d0, 0.51562d0, &
       0.50000d0, 1.00000d0, 0.50000d0, &
       0.51562d0, 1.00000d0, 0.48438d0, &
       0.53125d0, 1.00000d0, 0.46875d0, &
       0.54688d0, 1.00000d0, 0.45312d0, &
       0.56250d0, 1.00000d0, 0.43750d0, &
       0.57812d0, 1.00000d0, 0.42188d0, &
       0.59375d0, 1.00000d0, 0.40625d0, &
       0.60938d0, 1.00000d0, 0.39062d0, &
       0.62500d0, 1.00000d0, 0.37500d0, &
       0.64062d0, 1.00000d0, 0.35938d0, &
       0.65625d0, 1.00000d0, 0.34375d0, &
       0.67188d0, 1.00000d0, 0.32812d0, &
       0.68750d0, 1.00000d0, 0.31250d0, &
       0.70312d0, 1.00000d0, 0.29688d0, &
       0.71875d0, 1.00000d0, 0.28125d0, &
       0.73438d0, 1.00000d0, 0.26562d0, &
       0.75000d0, 1.00000d0, 0.25000d0, &
       0.76562d0, 1.00000d0, 0.23438d0, &
       0.78125d0, 1.00000d0, 0.21875d0, &
       0.79688d0, 1.00000d0, 0.20312d0, &
       0.81250d0, 1.00000d0, 0.18750d0, &
       0.82812d0, 1.00000d0, 0.17188d0, &
       0.84375d0, 1.00000d0, 0.15625d0, &
       0.85938d0, 1.00000d0, 0.14062d0, &
       0.87500d0, 1.00000d0, 0.12500d0, &
       0.89062d0, 1.00000d0, 0.10938d0, &
       0.90625d0, 1.00000d0, 0.09375d0, &
       0.92188d0, 1.00000d0, 0.07812d0, &
       0.93750d0, 1.00000d0, 0.06250d0, &
       0.95312d0, 1.00000d0, 0.04688d0, &
       0.96875d0, 1.00000d0, 0.03125d0, &
       0.98438d0, 1.00000d0, 0.01562d0, &
       1.00000d0, 1.00000d0, 0.00000d0, &
       1.00000d0, 0.98438d0, 0.00000d0, &
       1.00000d0, 0.96875d0, 0.00000d0, &
       1.00000d0, 0.95312d0, 0.00000d0, &
       1.00000d0, 0.93750d0, 0.00000d0, &
       1.00000d0, 0.92188d0, 0.00000d0, &
       1.00000d0, 0.90625d0, 0.00000d0, &
       1.00000d0, 0.89062d0, 0.00000d0, &
       1.00000d0, 0.87500d0, 0.00000d0, &
       1.00000d0, 0.85938d0, 0.00000d0, &
       1.00000d0, 0.84375d0, 0.00000d0, &
       1.00000d0, 0.82812d0, 0.00000d0, &
       1.00000d0, 0.81250d0, 0.00000d0, &
       1.00000d0, 0.79688d0, 0.00000d0, &
       1.00000d0, 0.78125d0, 0.00000d0, &
       1.00000d0, 0.76562d0, 0.00000d0, &
       1.00000d0, 0.75000d0, 0.00000d0, &
       1.00000d0, 0.73438d0, 0.00000d0, &
       1.00000d0, 0.71875d0, 0.00000d0, &
       1.00000d0, 0.70312d0, 0.00000d0, &
       1.00000d0, 0.68750d0, 0.00000d0, &
       1.00000d0, 0.67188d0, 0.00000d0, &
       1.00000d0, 0.65625d0, 0.00000d0, &
       1.00000d0, 0.64062d0, 0.00000d0, &
       1.00000d0, 0.62500d0, 0.00000d0, &
       1.00000d0, 0.60938d0, 0.00000d0, &
       1.00000d0, 0.59375d0, 0.00000d0, &
       1.00000d0, 0.57812d0, 0.00000d0, &
       1.00000d0, 0.56250d0, 0.00000d0, &
       1.00000d0, 0.54688d0, 0.00000d0, &
       1.00000d0, 0.53125d0, 0.00000d0, &
       1.00000d0, 0.51562d0, 0.00000d0, &
       1.00000d0, 0.50000d0, 0.00000d0, &
       1.00000d0, 0.48438d0, 0.00000d0, &
       1.00000d0, 0.46875d0, 0.00000d0, &
       1.00000d0, 0.45312d0, 0.00000d0, &
       1.00000d0, 0.43750d0, 0.00000d0, &
       1.00000d0, 0.42188d0, 0.00000d0, &
       1.00000d0, 0.40625d0, 0.00000d0, &
       1.00000d0, 0.39062d0, 0.00000d0, &
       1.00000d0, 0.37500d0, 0.00000d0, &
       1.00000d0, 0.35938d0, 0.00000d0, &
       1.00000d0, 0.34375d0, 0.00000d0, &
       1.00000d0, 0.32812d0, 0.00000d0, &
       1.00000d0, 0.31250d0, 0.00000d0, &
       1.00000d0, 0.29688d0, 0.00000d0, &
       1.00000d0, 0.28125d0, 0.00000d0, &
       1.00000d0, 0.26562d0, 0.00000d0, &
       1.00000d0, 0.25000d0, 0.00000d0, &
       1.00000d0, 0.23438d0, 0.00000d0, &
       1.00000d0, 0.21875d0, 0.00000d0, &
       1.00000d0, 0.20312d0, 0.00000d0, &
       1.00000d0, 0.18750d0, 0.00000d0, &
       1.00000d0, 0.17188d0, 0.00000d0, &
       1.00000d0, 0.15625d0, 0.00000d0, &
       1.00000d0, 0.14062d0, 0.00000d0, &
       1.00000d0, 0.12500d0, 0.00000d0, &
       1.00000d0, 0.10938d0, 0.00000d0, &
       1.00000d0, 0.09375d0, 0.00000d0, &
       1.00000d0, 0.07812d0, 0.00000d0, &
       1.00000d0, 0.06250d0, 0.00000d0, &
       1.00000d0, 0.04688d0, 0.00000d0, &
       1.00000d0, 0.03125d0, 0.00000d0, &
       1.00000d0, 0.01562d0, 0.00000d0, &
       1.00000d0, 0.00000d0, 0.00000d0, &
       0.98438d0, 0.00000d0, 0.00000d0, &
       0.96875d0, 0.00000d0, 0.00000d0, &
       0.95312d0, 0.00000d0, 0.00000d0, &
       0.93750d0, 0.00000d0, 0.00000d0, &
       0.92188d0, 0.00000d0, 0.00000d0, &
       0.90625d0, 0.00000d0, 0.00000d0, &
       0.89062d0, 0.00000d0, 0.00000d0, &
       0.87500d0, 0.00000d0, 0.00000d0, &
       0.85938d0, 0.00000d0, 0.00000d0, &
       0.84375d0, 0.00000d0, 0.00000d0, &
       0.82812d0, 0.00000d0, 0.00000d0, &
       0.81250d0, 0.00000d0, 0.00000d0, &
       0.79688d0, 0.00000d0, 0.00000d0, &
       0.78125d0, 0.00000d0, 0.00000d0, &
       0.76562d0, 0.00000d0, 0.00000d0, &
       0.75000d0, 0.00000d0, 0.00000d0, &
       0.73438d0, 0.00000d0, 0.00000d0, &
       0.71875d0, 0.00000d0, 0.00000d0, &
       0.70312d0, 0.00000d0, 0.00000d0, &
       0.68750d0, 0.00000d0, 0.00000d0, &
       0.67188d0, 0.00000d0, 0.00000d0, &
       0.65625d0, 0.00000d0, 0.00000d0, &
       0.64062d0, 0.00000d0, 0.00000d0, &
       0.62500d0, 0.00000d0, 0.00000d0, &
       0.60938d0, 0.00000d0, 0.00000d0, &
       0.59375d0, 0.00000d0, 0.00000d0, &
       0.57812d0, 0.00000d0, 0.00000d0, &
       0.56250d0, 0.00000d0, 0.00000d0, &
       0.54688d0, 0.00000d0, 0.00000d0, &
       0.53125d0, 0.00000d0, 0.00000d0, &
       0.51562d0, 0.00000d0, 0.00000d0, &
       0.50000d0, 0.00000d0, 0.00000d0 &
       ]*255), [3,256])
  
contains
  !> finalizer
  elemental subroutine destructor(self)
    class(solution_helmholtz),intent(inout) :: self

    if(associated(self%mesh)) nullify(self%mesh)
    if(allocated(self%u_bndry)) deallocate(self%u_bndry)

    if(allocated(self%gauss_tri_xi)) deallocate(self%gauss_tri_xi)
    if(allocated(self%gauss_tri_w)) deallocate(self%gauss_tri_w)
  end subroutine destructor
  
  !> 初期化
  !! \param self
  !! \param mesh 境界メッシュ
  !! \param w 角周波数
  !! \param c 位相速度
  subroutine init(self, mesh, w, c)
    class(solution_helmholtz),intent(out) :: self
    type(mesh3d),intent(inout),target :: mesh
    real(8),intent(in) :: w
    real(8),intent(in) :: c

    call self%destructor

    self%mesh => mesh
    self%w = w
    self%c = c
    
    self%k = self%w / self%c

    allocate(self%u_bndry(self%mesh%ne,2))
    self%u_bndry(:,:) = zero

    ! 三角形Gauss積分の点数はとりあえず6とする
    self%ng_tri = 6
    allocate(self%gauss_tri_xi(3,self%ng_tri), self%gauss_tri_w(self%ng_tri))
    call generate_gauss_triangle(self%ng_tri, self%gauss_tri_xi, self%gauss_tri_w)
  end subroutine init

  !> 境界の解をファイルに出力
  !! \param self
  !! \param filename ファイル名
  subroutine output_bndry(self, filename)
    class(solution_helmholtz),intent(in) :: self
    character(*),intent(in) :: filename

    integer :: i

    open(10,file=filename)
    do i=1,self%mesh%ne
       write(10,'(7e24.16)') self%mesh%c(1:3,i), real(self%u_bndry(i,1)), aimag(self%u_bndry(i,1)), &
            real(self%u_bndry(i,2)), aimag(self%u_bndry(i,2))
    end do
    close(10)
    
  end subroutine output_bndry

  !> 境界の解をファイルに出力 (geomviewで表示用)
  !! \param self
  !! \param filename ファイル名
  subroutine output_bndry_geomview(self, filename)
    class(solution_helmholtz),intent(in) :: self
    character(*),intent(in) :: filename

    real(8) :: maxu, minu, tmp
    integer :: i

    open(10,file=filename)
    write(10,'(A)') "OFF"
    write(10,'(3i7)') self%mesh%np, self%mesh%ne, 0
    do i=1,self%mesh%np
       ! write(10,'(3f10.6)') self%mesh%p(1,i),self%mesh%p(2,i),self%mesh%p(3,i)
       write(10,'(3e24.16)') self%mesh%p(1,i),self%mesh%p(2,i),self%mesh%p(3,i)
    end do
    
    maxu=maxval(real(self%u_bndry(:,1)))
    minu=minval(real(self%u_bndry(:,1)))

    write(*,*) minu, maxu
    
    do i=1,self%mesh%ne       
       tmp=(real(self%u_bndry(i,1))-minu)*255.d0/(maxu-minu)+1.d0
       
       
       write(10,'(i2,3i7,4i4)') 3,self%mesh%nd(1,i)-1,self%mesh%nd(3,i)-1,self%mesh%nd(2,i)-1,&
       	cmap(1,int(tmp)),cmap(2,int(tmp)),cmap(3,int(tmp)),255
       ! write(2,*) int(tmp)
    end do
    close(10)
    
  end subroutine output_bndry_geomview

  !> 境界の解を積分してmesh%centerを原点とするoutgoing coefficientsを計算
  !! \param self
  !! \param nmax 計算する係数の次数nの最大値
  !! \param B outgoing coefficients
  subroutine calc_B(self, nmax, B)
    class(solution_helmholtz),intent(in) :: self
    integer,intent(in) :: nmax
    complex(8),intent(out) :: B((nmax+1)**2)

    integer :: n, m, i
    real(8) :: y_vec(3), nvec(3)
    integer :: ig
    complex(8),allocatable :: integ(:)
    integer :: size
    complex(8),allocatable :: Inm_derivative(:,:)
    complex(8) :: u
    
    B = zero

    size = (nmax+1)**2
    allocate(integ(size))
    allocate(Inm_derivative(3,size))

    ! 各要素について
    do i=1,self%mesh%ne
       u = self%u_bndry(i,1)
       nvec(:) = self%mesh%an(:,i)
       
       ! Gauss積分
       integ(:) = zero
       do ig=1,self%ng_tri
          ! 積分点 (Cartesian)
          y_vec = convert_area_to_Cartesian(&
               self%mesh%p(:,self%mesh%nd(1,i)),&
               self%mesh%p(:,self%mesh%nd(2,i)),&
               self%mesh%p(:,self%mesh%nd(3,i)),&
               self%gauss_tri_xi(:,ig))
          
          ! I_n^mの勾配を計算
          call calc_Inm_derivative(self%k, y_vec-self%mesh%center, nmax, Inm_derivative)          
          
          ! 各次数について足す
          do n=0,nmax
             do m=-n,n
                ! -mであることに注意
                integ(loct(n,m)) = integ(loct(n,m)) + self%gauss_tri_w(ig) * (&
                     - rdot_product(Inm_derivative(1:3,loct(n,-m)),nvec)*u &
                     )
             end do
          end do                    
          
       end do
       ! integの計算終わり

       do n=0,nmax
          do m=-n,n
             B(loct(n,m)) = B(loct(n,m)) + integ(loct(n,m))*self%mesh%ar(i)
          end do
       end do
       
    end do

    ! ione*k/(4*pi)*(2*n+1)*(-1)**mを掛ける
    do n=0,nmax
       do m=-n,n
          B(loct(n,m)) = B(loct(n,m)) * ione*self%k/(4.d0*pi)*(2*n+1)*(-1)**m
       end do
    end do
    
  end subroutine calc_B
end module solution_helmholtz_class
